In [11]:
'''
190031554 -- Surya Teja Koka (Task 1 for Data Science)

A)INTRODUCTION TO PANDAS

B) Include  .csv file in python

• 1. Use series method to convert the following list [‘a’,’b’,’c’,’d’]  

•2. Given the lists which contain names of students and their scored marks you have to create data frames which 
    club them all using pandas. student list is [' Name 1' ,' Name 2', ' Name 3' ,' Name 4', ' Name 5' ' Name 6'] 
    and you are given a 2d matrix which contain their marks. 
    Their marks are [[67,89,68,95], [87,94,97,76], [77,85,99,74], [90,89,92,78], [83,97,80,98],[90,90,80,87]] 
    and subjects list containing ['DS','AI','MPII', 'CNS']  

•3. Add the TS , total columns to the data frame from which TS is the sum of  DS,AI,MPII and 
    total is the sum of all subjects?  

•4. Display only the marks scored by Name 2 and Name3?  

•5. Display all the students marks who scored 90 + marks in DS? 

• 6. DS teacher wants to know the total marks achieved by students in AI, Help her by using the sum method in data frame '''

"\n190031554 -- Surya Teja Koka (Task 1 for Data Science)\n\nA)INTRODUCTION TO PANDAS\n\nB) Include  .csv file in python\n\n• 1. Use series method to convert the following list [‘a’,’b’,’c’,’d’]  \n\n•2. Given the lists which contain names of students and their scored marks you have to create data frames which \n    club them all using pandas. student list is [' Name 1' ,' Name 2', ' Name 3' ,' Name 4', ' Name 5' ' Name 6'] \n    and you are given a 2d matrix which contain their marks. \n    Their marks are [[67,89,68,95], [87,94,97,76], [77,85,99,74], [90,89,92,78], [83,97,80,98],[90,90,80,87]] \n    and subjects list containing ['DS','AI','MPII', 'CNS']  \n\n•3. Add the TS , total columns to the data frame from which TS is the sum of  DS,AI,MPII and \n    total is the sum of all subjects?  \n\n•4. Display only the marks scored by Name 2 and Name3?  \n\n•5. Display all the students marks who scored 90 + marks in DS? \n\n• 6. DS teacher wants to know the total marks achieved by students in AI, Help her by using the sum method in data frame "

In [3]:
import pandas as pd

In [4]:
import numpy as np

In [5]:
list=['a','b','c','d']

In [6]:
series= pd.Series(list)

In [7]:
print(series)

0    a
1    b
2    c
3    d
dtype: object

In [8]:
d=['Surya','Surya Teja','Surya Teja Koka','Bhanu','Bhanu Sri','Bhanu Sri Edupuganti']
m=[[77,89,92,95],[85,94,97,76],[92,95,99,98],[90,89,92,78],[83,97,80,90],[95,98,99,100]] 

'''
There is no one who scored morethan 90 in DS as per the data 
but a question is asked to show them so,
I have changed and made the scores as given above
'''

s=['DS','AI','MPII','CNS']

In [9]:
df= pd.DataFrame(data= m, index= d, columns=s)

In [10]:
df

                      DS  AI  MPII  CNS
Surya                 77  89    92   95
Surya Teja            85  94    97   76
Surya Teja Koka       92  95    99   98
Bhanu                 90  89    92   78
Bhanu Sri             83  97    80   90
Bhanu Sri Edupuganti  95  98    99  100

In [11]:
df['TS']= df['DS']+df['AI']+df['MPII']+df['CNS']

In [12]:
df

                      DS  AI  MPII  CNS   TS
Surya                 77  89    92   95  353
Surya Teja            85  94    97   76  352
Surya Teja Koka       92  95    99   98  384
Bhanu                 90  89    92   78  349
Bhanu Sri             83  97    80   90  350
Bhanu Sri Edupuganti  95  98    99  100  392

In [17]:
z = df.iloc[1:3]

In [18]:
z

                 DS  AI  MPII  CNS   TS
Surya Teja       85  94    97   76  352
Surya Teja Koka  92  95    99   98  384

In [24]:
df['SPI']=df['DS']+df['AI']

In [25]:
df

                      DS  AI  MPII  CNS   TS  SPI
Surya                 77  89    92   95  353  166
Surya Teja            85  94    97   76  352  179
Surya Teja Koka       92  95    99   98  384  187
Bhanu                 90  89    92   78  349  179
Bhanu Sri             83  97    80   90  350  180
Bhanu Sri Edupuganti  95  98    99  100  392  193

In [26]:
df['total']=df['DS']+df['AI']+df['CNS']+df['MPII']+df['SPI']

In [27]:
df

                      DS  AI  MPII  CNS   TS  SPI  total
Surya                 77  89    92   95  353  166    519
Surya Teja            85  94    97   76  352  179    531
Surya Teja Koka       92  95    99   98  384  187    571
Bhanu                 90  89    92   78  349  179    528
Bhanu Sri             83  97    80   90  350  180    530
Bhanu Sri Edupuganti  95  98    99  100  392  193    585

In [28]:
df.loc[['Surya','Bhanu']]

       DS  AI  MPII  CNS   TS  SPI  total
Surya  77  89    92   95  353  166    519
Bhanu  90  89    92   78  349  179    528

In [29]:
df[df['DS']>90]

                      DS  AI  MPII  CNS   TS  SPI  total
Surya Teja Koka       92  95    99   98  384  187    571
Bhanu Sri Edupuganti  95  98    99  100  392  193    585

In [19]:
sum(df['DS'])

522

In [31]:
dataset = pd.read_csv('names.csv')

In [32]:
dataset

              Name  DS  AI  MP2  CNS
0            surya  77  99   92   95
1      surya teja   85  95   97   76
2  surya teja koka  98  91   93   92
3            Bhanu  98  91   93   92
4           Udbhav  98  91   93   92
5  N chandan kumar  98  91   93   92

In [47]:

import pandas as pd
s = pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])

#retrieve the first element
print (s[-3:-1])

c    3
d    4
dtype: int64